w3-4/w4d5/music_app/app/views/bands/index.html.erb

SELECT "bands".* FROM "bands"
---
  <br>
  <% Band.all.each do |band| %>