w3-4/w4d5/music_app/app/controllers/bands_controller.rb

  def destroy
    band = Band.find_by(id: params[:id])
    flash[:notice] = "#{band.name} deleted"
    band.delete if band
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 14]]