w3-4/w4d5/music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "qwd"], ["LIMIT", 1]]
---
  def self::find_by_credentials(email, password)
    user = User.find_by(email: email)

SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "oe4mII6YAkqlCzIgsrjFeg"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    token = SecureRandom::urlsafe_base64(16)
    while self.class.exists?(session_token: token)